Repository: 0xJacky/vphone-cli
Catalog: VPhoneLaunchpad/VPhoneLaunchpad/Localizable.xcstrings
Source language: en
Languages: ja, ko, vi, zh_hans

source: Update the privileged helper in Host Setup, then run preflight again.
ja: 「ホスト設定」で特権ヘルパーをアップデートしてから、事前チェックを再実行してください。
ko: 호스트 설정에서 권한 있는 도우미를 업데이트한 후 사전 점검을 다시 실행하십시오.
vi: Hãy cập nhật trình trợ giúp đặc quyền trong Thiết lập máy chủ, rồi chạy lại kiểm tra trước.
zh_hans: 请在“主机设置”中更新特权 Helper，然后再次运行预检。

source: Update…
ja: アップデート…
ko: 업데이트…
vi: Cập nhật…
zh_hans: 更新…

source: URL or path
ja: URL またはパス
ko: URL 또는 경로
vi: URL hoặc đường dẫn
zh_hans: URL 或路径

source: Unable to Add Folder
ja: フォルダを追加できません
ko: 폴더를 추가할 수 없음
vi: Không thể thêm thư mục
zh_hans: 无法添加文件夹

source: Use letters, numbers, periods, hyphens, and underscores.
ja: 英字、数字、ピリオド、ハイフン、アンダースコアを使用してください。
ko: 문자, 숫자, 마침표, 하이픈, 밑줄을 사용하십시오.
vi: Hãy dùng chữ cái, chữ số, dấu chấm, dấu gạch nối và dấu gạch dưới.
zh_hans: 请使用字母、数字、句点、连字符和下划线。

source: Use this version without the failed checks.
ja: 不合格のチェックを無視してこのバージョンを使用します。
ko: 실패한 검사를 무시하고 이 버전을 사용합니다.
vi: Dùng phiên bản này mà không cần các mục kiểm tra không đạt.
zh_hans: 忽略未通过的检查，使用此版本。

source: Used by
ja: 使用中のマシン
ko: 사용 중인 머신
vi: Được dùng bởi
zh_hans: 使用者

source: Use Without Preflight
ja: 事前チェックなしで使用
ko: 사전 점검 없이 사용
vi: Dùng mà không kiểm tra trước
zh_hans: 不经预检直接使用

source: Verify SHA-256
ja: SHA-256 を検証
ko: SHA-256 확인
vi: Xác minh SHA-256
zh_hans: 验证 SHA-256

source: Version %@
ja: バージョン %@
ko: 버전 %@
vi: Phiên bản %@
zh_hans: 版本 %@

source: Version %@ installed
ja: バージョン %@ をインストール済み
ko: 버전 %@ 설치됨
vi: Đã cài phiên bản %@
zh_hans: 已安装版本 %@

source: Version %@ installed, %@ available
ja: バージョン %1$@ をインストール済み、%2$@ が利用可能
ko: 버전 %1$@ 설치됨, %2$@ 사용 가능
vi: Đã cài phiên bản %1$@, có phiên bản %2$@
zh_hans: 已安装版本 %1$@，可用版本 %2$@

source: View Details
ja: 詳細を表示
ko: 세부 정보 보기
vi: Xem chi tiết
zh_hans: 查看详情

source: VPhone.bundle %@ is not supported. Use version %@ or newer.
ja: VPhone.bundle %1$@ は非対応です。%2$@ 以降を使用してください。
ko: VPhone.bundle %1$@은(는) 지원되지 않습니다. %2$@ 이상을 사용하세요.
vi: VPhone.bundle %1$@ không được hỗ trợ. Hãy dùng phiên bản %2$@ trở lên.
zh_hans: 不支持 VPhone.bundle %1$@。请使用 %2$@ 或更新版本。

source: Variant
ja: バリアント
ko: 변형
vi: Biến thể
zh_hans: 变体

source: Wait for DFU
ja: DFU を待機
ko: DFU 대기
vi: Chờ DFU
zh_hans: 等待 DFU

source: Wait for the machine's current action to finish.
ja: マシンの現在の処理が終わるまでお待ちください。
ko: 머신의 현재 작업이 끝날 때까지 기다리십시오.
vi: Hãy chờ thao tác hiện tại của máy ảo hoàn tất.
zh_hans: 请等待虚拟机当前的操作完成。

source: Waiting for administrator approval…
ja: 管理者の承認を待機中…
ko: 관리자 승인 대기 중…
vi: Đang chờ quản trị viên phê duyệt…
zh_hans: 正在等待管理员批准…

source: Waiting to export…
ja: 書き出し待ち…
ko: 내보내기 대기 중…
vi: Đang chờ xuất…
zh_hans: 等待导出…

source: Warning
ja: 警告
ko: 경고
vi: Cảnh báo
zh_hans: 警告

source: You cannot write to %@.
ja: %@ に書き込めません。
ko: %@에 쓸 수 없습니다.
vi: Bạn không thể ghi vào %@.
zh_hans: 你无法写入 %@。

source: Zip the bundle with `ditto -c -k --keepParent VPhone.bundle VPhone.zip`, or choose the VPhone.bundle folder.
ja: `ditto -c -k --keepParent VPhone.bundle VPhone.zip` でバンドルを zip に圧縮するか、VPhone.bundle フォルダを選択してください。
ko: `ditto -c -k --keepParent VPhone.bundle VPhone.zip`로 번들을 압축하거나 VPhone.bundle 폴더를 선택하십시오.
vi: Hãy nén bundle bằng `ditto -c -k --keepParent VPhone.bundle VPhone.zip`, hoặc chọn thư mục VPhone.bundle.
zh_hans: 请使用 `ditto -c -k --keepParent VPhone.bundle VPhone.zip` 压缩 Bundle，或选择 VPhone.bundle 文件夹。

source: IPv4 Address
ja: IPv4 アドレス
ko: IPv4 주소
vi: Địa chỉ IPv4
zh_hans: IPv4 地址

source: MAC Address
ja: MAC アドレス
ko: MAC 주소
vi: Địa chỉ MAC
zh_hans: MAC 地址

source: Port Forward
ja: ポートフォワード
ko: 포트 포워드
vi: Chuyển tiếp cổng
zh_hans: 端口转发

source: Address
ja: アドレス
ko: 주소
vi: Địa chỉ
zh_hans: 地址

source: Addresses Held by Old Guests
ja: 古いゲストが保持しているアドレス
ko: 이전 게스트가 보유한 주소
vi: Địa chỉ do máy khách cũ giữ
zh_hans: 旧客户机占用的地址

source: Configure IPv4
ja: IPv4 の構成
ko: IPv4 구성
vi: Cấu hình IPv4
zh_hans: 配置 IPv4

source: Using DHCP
ja: DHCP を使用
ko: DHCP 사용
vi: Dùng DHCP
zh_hans: 使用 DHCP

source: Manually
ja: 手入力
ko: 수동
vi: Thủ công
zh_hans: 手动

source: Gateway
ja: ゲートウェイ
ko: 게이트웨이
vi: Cổng mặc định
zh_hans: 网关

source: Gateway and DNS
ja: ゲートウェイと DNS
ko: 게이트웨이 및 DNS
vi: Cổng mặc định và DNS
zh_hans: 网关和 DNS

source: DNS Servers
ja: DNS サーバ
ko: DNS 서버
vi: Máy chủ DNS
zh_hans: DNS 服务器

source: Automatic
ja: 自動
ko: 자동
vi: Tự động
zh_hans: 自动

source: Generated at next start
ja: 次回起動時に生成
ko: 다음 시작 시 생성
vi: Tạo khi khởi động lần tới
zh_hans: 下次启动时生成

source: Generate
ja: 生成
ko: 생성
vi: Tạo
zh_hans: 生成

source: Use an address on the Mac's shared NAT network, usually 192.168.64.0/24. For another subnet, use Tunnel.
ja: Mac の共有 NAT ネットワーク（通常は 192.168.64.0/24）上のアドレスを使用してください。ほかのサブネットにはトンネルを使用します。
ko: Mac의 공유 NAT 네트워크(보통 192.168.64.0/24)의 주소를 사용하세요. 다른 서브넷에는 터널을 사용하세요.
vi: Hãy dùng địa chỉ trên mạng NAT dùng chung của máy Mac, thường là 192.168.64.0/24. Với mạng con khác, hãy dùng Đường hầm.
zh_hans: 请使用 Mac 共享 NAT 网络上的地址，通常是 192.168.64.0/24。其他子网请使用隧道模式。

source: The tunnel hands this address to the guest itself.
ja: このアドレスはトンネル自身がゲストに割り当てます。
ko: 이 주소는 터널이 직접 게스트에 할당합니다.
vi: Đường hầm tự cấp địa chỉ này cho máy khách.
zh_hans: 这个地址由隧道直接分配给客户机。

source: vphoned sets this address in the guest. Use your network's gateway and DNS servers.
ja: vphoned がゲスト内にこのアドレスを設定します。ネットワークのゲートウェイと DNS サーバを指定してください。
ko: vphoned가 게스트에 이 주소를 설정합니다. 네트워크의 게이트웨이와 DNS 서버를 입력하세요.
vi: vphoned đặt địa chỉ này trong máy khách. Hãy dùng cổng mặc định và máy chủ DNS của mạng bạn.
zh_hans: vphoned 会在客户机内设置这个地址。请填写所在网络的网关和 DNS 服务器。

source: Protocol
ja: プロトコル
ko: 프로토콜
vi: Giao thức
zh_hans: 协议

source: Mac Port
ja: Mac のポート
ko: Mac 포트
vi: Cổng trên Mac
zh_hans: Mac 端口

source: Machine
ja: マシン
ko: 머신
vi: Máy ảo
zh_hans: 虚拟机

source: Machine Folders
ja: マシンフォルダ
ko: 머신 폴더
vi: Thư mục máy ảo
zh_hans: 虚拟机文件夹

source: Machine disks
ja: マシンのディスク
ko: 머신 디스크
vi: Ổ đĩa máy ảo
zh_hans: 虚拟机磁盘

source: Guest Port
ja: ゲストのポート
ko: 게스트 포트
vi: Cổng máy khách
zh_hans: 客户机端口

source: Add
ja: 追加
ko: 추가
vi: Thêm
zh_hans: 添加

source: Add Folder…
ja: フォルダを追加…
ko: 폴더 추가…
vi: Thêm thư mục…
zh_hans: 添加文件夹…

source: Add Machine Folder
ja: マシンフォルダを追加
ko: 머신 폴더 추가
vi: Thêm thư mục máy ảo
zh_hans: 添加虚拟机文件夹

source: Add a Forward
ja: フォワードを追加
ko: 포워드 추가
vi: Thêm chuyển tiếp
zh_hans: 添加转发

source: Reachable from other devices
ja: ほかのデバイスからアクセス可能
ko: 다른 기기에서 접근 가능
vi: Thiết bị khác có thể truy cập
zh_hans: 允许其他设备访问

source: Reaches the guest by
ja: ゲストへの反映方法
ko: 게스트 반영 방법
vi: Đến máy khách qua
zh_hans: 送达客户机的方式

source: Read from the machine folder at every boot. fw patch needs the prepared restore files.
ja: 起動するたびにマシンフォルダから読み込まれます。fw patch には準備した復元ファイルが必要です。
ko: 부팅할 때마다 머신 폴더에서 읽습니다. fw patch에는 준비된 복원 파일이 필요합니다.
vi: Được đọc từ thư mục máy ảo mỗi lần khởi động. fw patch cần các tệp khôi phục đã chuẩn bị.
zh_hans: 每次启动时从虚拟机文件夹读取。fw patch 需要准备好的恢复文件。

source: Reading the IPSW cache…
ja: IPSW キャッシュを読み込み中…
ko: IPSW 캐시 읽는 중…
vi: Đang đọc bộ nhớ đệm IPSW…
zh_hans: 正在读取 IPSW 缓存…

source: Port Forwarding
ja: ポートフォワーディング
ko: 포트 포워딩
vi: Chuyển tiếp cổng
zh_hans: 端口转发

source: Port Forwards
ja: ポートフォワード
ko: 포트 포워드
vi: Chuyển tiếp cổng
zh_hans: 端口转发

source: A forwarded port listens on this Mac only, unless it is reachable from other devices.
ja: 転送したポートは、ほかのデバイスからのアクセスを許可しない限り、この Mac 上でのみ待ち受けます。
ko: 다른 기기에서 접근 가능으로 설정하지 않으면 전달된 포트는 이 Mac에서만 수신합니다.
vi: Cổng được chuyển tiếp chỉ lắng nghe trên máy Mac này, trừ khi cho phép thiết bị khác truy cập.
zh_hans: 转发的端口只在这台 Mac 上监听，除非允许其他设备访问。

source: This mode cannot forward ports, so saving removes the port forwards.
ja: このモードではポートを転送できないため、保存するとポートフォワードが削除されます。
ko: 이 모드는 포트를 전달할 수 없으므로 저장하면 포트 포워드가 제거됩니다.
vi: Chế độ này không chuyển tiếp cổng được, nên khi lưu các chuyển tiếp cổng sẽ bị xóa.
zh_hans: 此模式不能转发端口，保存后会移除端口转发。

source: Total
ja: 合計
ko: 합계
vi: Tổng
zh_hans: 总计

source: Port forwarding needs NAT or Tunnel. Change the mode in Network.
ja: ポートフォワーディングには NAT またはトンネルが必要です。モードは「ネットワーク」で変更します。
ko: 포트 포워딩에는 NAT 또는 터널이 필요합니다. 모드는 네트워크에서 변경하세요.
vi: Chuyển tiếp cổng cần NAT hoặc Đường hầm. Đổi chế độ trong Mạng.
zh_hans: 端口转发需要 NAT 或隧道模式，请在“网络”中更改模式。

source: General
ja: 一般
ko: 일반
vi: Chung
zh_hans: 通用

source: mDNS Name
ja: mDNS 名
ko: mDNS 이름
vi: Tên mDNS
zh_hans: mDNS 名称

source: Reachable as %@.local
ja: %@.local でアクセス可能
ko: %@.local(으)로 접근 가능
vi: Truy cập được qua %@.local
zh_hans: 可通过 %@.local 访问

source: Resolve this Mac's name in the guest
ja: ゲスト内でこの Mac の名前を解決
ko: 게스트에서 이 Mac의 이름 확인
vi: Phân giải tên của máy Mac này trong máy khách
zh_hans: 在客户机内解析这台 Mac 的名称

source: Resources
ja: リソース
ko: 리소스
vi: Tài nguyên
zh_hans: 资源

source: Startup
ja: 起動
ko: 시작
vi: Khởi động
zh_hans: 启动

source: Unlock at startup
ja: 起動時にロックを解除
ko: 시작 시 잠금 해제
vi: Mở khóa khi khởi động
zh_hans: 启动时解锁

source: Unreadable
ja: 読み取れません
ko: 읽을 수 없음
vi: Không đọc được
zh_hans: 无法读取

source: Unused IPSWs can be removed in Firmwares.
ja: 未使用の IPSW は「ファームウェア」で削除できます。
ko: 사용하지 않는 IPSW는 펌웨어에서 제거할 수 있습니다.
vi: Có thể xóa các IPSW không dùng trong Firmware.
zh_hans: 可以在“固件”中移除未使用的 IPSW。

source: Unlock at Startup
ja: 起動時にロックを解除
ko: 시작 시 잠금 해제
vi: Mở khóa khi khởi động
zh_hans: 启动时解锁

source: Each time the guest starts, its screen is turned on and the Lock Screen dismissed.
ja: ゲストが起動するたびに画面をオンにし、ロック画面を閉じます。
ko: 게스트가 시작될 때마다 화면을 켜고 잠금 화면을 닫습니다.
vi: Mỗi khi máy khách khởi động, màn hình được bật và Màn hình khóa được đóng.
zh_hans: 客户机每次启动时点亮屏幕并关闭锁定屏幕。

source: Edit…
ja: 編集…
ko: 편집…
vi: Sửa…
zh_hans: 编辑…

source: Erases the data
ja: データを消去
ko: 데이터 지움
vi: Xóa dữ liệu
zh_hans: 会抹掉数据

source: %@ (Default)
ja: %@（デフォルト）
ko: %@(기본값)
vi: %@ (Mặc định)
zh_hans: %@（默认）

source: %@ (creating)
ja: %@（作成中）
ko: %@(생성 중)
vi: %@ (đang tạo)
zh_hans: %@（创建中）

source: Apply
ja: 適用
ko: 적용
vi: Áp dụng
zh_hans: 应用

source: Boot Chain
ja: ブートチェーン
ko: 부트 체인
vi: Chuỗi khởi động
zh_hans: 启动链

source: Change Core Bundle of %@
ja: %@ のコアバンドルを変更
ko: %@의 코어 번들 변경
vi: Đổi Bundle lõi của %@
zh_hans: 更改 %@ 的核心 Bundle

source: Change Core Bundle of %lld Machines
ja: %lld 台のマシンのコアバンドルを変更
ko: 머신 %lld대의 코어 번들 변경
vi: Đổi Bundle lõi của %lld máy
zh_hans: 更改 %lld 台机器的核心 Bundle

source: Change Core Bundle…
ja: コアバンドルを変更…
ko: 코어 번들 변경…
vi: Đổi Bundle lõi…
zh_hans: 更改核心 Bundle…

source: Changed
ja: 変更済み
ko: 변경됨
vi: Đã đổi
zh_hans: 已更改

source: Change…
ja: 変更…
ko: 변경…
vi: Thay đổi…
zh_hans: 更改…

source: Checking Core Bundle…
ja: コアバンドルを確認中…
ko: 코어 번들 확인 중…
vi: Đang kiểm tra Bundle lõi…
zh_hans: 正在检查核心 Bundle…

source: Checking helper…
ja: ヘルパーを確認中…
ko: 도우미 확인 중…
vi: Đang kiểm tra trình trợ giúp…
zh_hans: 正在检查辅助工具…

source: Checking this Mac…
ja: この Mac を確認中…
ko: 이 Mac 확인 중…
vi: Đang kiểm tra máy Mac này…
zh_hans: 正在检查这台 Mac…

source: Choose another Core Bundle for its machines first.
ja: 先に、このバージョンを使うマシンに別のコアバンドルを選択してください。
ko: 먼저 이 버전을 사용하는 머신에 다른 코어 번들을 선택하세요.
vi: Hãy chọn Bundle lõi khác cho các máy đang dùng phiên bản này trước.
zh_hans: 请先为使用此版本的机器选择其他核心 Bundle。

source: Current
ja: 現在
ko: 현재
vi: Hiện tại
zh_hans: 当前

source: Default
ja: デフォルト
ko: 기본값
vi: Mặc định
zh_hans: 默认

source: The Core Bundle that built the boot chain when the machine was created.
ja: マシンの作成時にブートチェーンを構築したコアバンドルです。
ko: 머신을 만들 때 부트 체인을 빌드한 코어 번들입니다.
vi: Bundle lõi đã dựng chuỗi khởi động khi tạo máy.
zh_hans: 创建虚拟机时构建启动链的核心 Bundle。

source: The Mac keeps an address for every guest MAC it has seen. Release frees the ones no machine uses any more. It needs an administrator.
ja: Mac は、これまでに見たすべてのゲストの MAC に対してアドレスを保持します。「解放」は、どのマシンも使わなくなったアドレスを解放します。管理者権限が必要です。
ko: Mac은 지금까지 본 모든 게스트 MAC에 대해 주소를 보유합니다. ‘해제’는 더 이상 어떤 머신도 사용하지 않는 주소를 해제하며, 관리자 권한이 필요합니다.
vi: Máy Mac giữ một địa chỉ cho mọi MAC máy khách mà nó từng thấy. Giải phóng sẽ trả lại những địa chỉ không còn máy ảo nào dùng. Cần quyền quản trị viên.
zh_hans: Mac 会为它见过的每个客户机 MAC 保留一个地址。“释放”会释放不再被任何虚拟机使用的地址，需要管理员权限。

source: The address the Mac’s DHCP server holds for this MAC
ja: Mac の DHCP サーバがこの MAC に割り当てているアドレス
ko: Mac의 DHCP 서버가 이 MAC에 할당해 둔 주소
vi: Địa chỉ mà máy chủ DHCP của Mac giữ cho MAC này
zh_hans: Mac 的 DHCP 服务器为此 MAC 保留的地址

source: Overrides
ja: 変更
ko: 변경 사항
vi: Thay đổi
zh_hans: 更改

source: Page
ja: ページ
ko: 페이지
vi: Trang
zh_hans: 页面

source: Part
ja: 部位
ko: 구성 요소
vi: Thành phần
zh_hans: 部件

source: Off: %@
ja: オフ：%@
ko: 끔: %@
vi: Tắt: %@
zh_hans: 关闭：%@

source: On: %@
ja: オン：%@
ko: 켬: %@
vi: Bật: %@
zh_hans: 启用：%@

source: One advisory check needs a look: %@.
ja: 1 件の推奨項目を確認してください：%@。
ko: 권장 사항 1개를 확인해야 합니다: %@.
vi: Một mục khuyến nghị cần xem lại: %@.
zh_hans: 有 1 个建议项需要留意：%@。

source: Only a restore applies it, which erases the data
ja: 復元でのみ適用され、データは消去されます
ko: 복원으로만 적용되며 데이터가 지워짐
vi: Chỉ khôi phục mới áp dụng, và sẽ xóa dữ liệu
zh_hans: 只有恢复才会应用，恢复会抹掉数据

source: Not Applied
ja: 未適用
ko: 적용 안 됨
vi: Chưa áp dụng
zh_hans: 未应用

source: ^[%lld patch](inflect: true)
ja: %lld 件のパッチ
ko: 패치 %lld개
vi: %lld bản vá
zh_hans: %lld 个补丁

# ^[%lld patch](inflect: true) not applied to %@
source: %lld patches not applied to %2$@
ja: %2$@ に未適用のパッチ %1$lld 件
ko: %2$@에 적용되지 않은 패치 %1$lld개
vi: %1$lld bản vá chưa áp dụng cho %2$@
zh_hans: %1$lld 个补丁尚未应用到 %2$@

source: The guest has every patch this machine is set to.
ja: このマシンに設定したパッチはすべてゲストに適用されています。
ko: 이 머신에 설정한 패치가 모두 게스트에 적용되어 있습니다.
vi: Máy khách đã có mọi bản vá được đặt cho máy này.
zh_hans: 客户机已包含为此虚拟机设定的全部补丁。

source: The guest is not installed yet, so these differ from the last fw patch. The next fw patch, restore and cfw install build the machine with this choice.
ja: ゲストがまだインストールされていないため、これらは前回の fw patch と異なります。次回の fw patch、復元、cfw install でこの選択に基づいてマシンが構築されます。
ko: 게스트가 아직 설치되지 않아 마지막 fw patch와 다릅니다. 다음 fw patch, 복원 및 cfw install에서 이 선택대로 머신을 빌드합니다.
vi: Máy khách chưa được cài, nên các mục này khác với lần fw patch trước. Lần fw patch, khôi phục và cfw install tiếp theo sẽ dựng máy ảo theo lựa chọn này.
zh_hans: 客户机尚未安装，因此这些设置与上次 fw patch 不同。下次运行 fw patch、恢复和 cfw install 时会按此选择构建虚拟机。

source: The guest joins a physical network of the Mac with its own address, so other devices on that network can reach it. It needs no port forwards.
ja: ゲストは独自のアドレスで Mac の物理ネットワークに参加するため、そのネットワーク上のほかのデバイスからアクセスできます。ポートフォワードは不要です。
ko: 게스트가 자체 주소로 Mac의 물리 네트워크에 참여하므로 해당 네트워크의 다른 기기에서 접근할 수 있습니다. 포트 포워드가 필요 없습니다.
vi: Máy khách tham gia một mạng vật lý của máy Mac với địa chỉ riêng, nên các thiết bị khác trong mạng đó có thể truy cập nó. Không cần chuyển tiếp cổng.
zh_hans: 客户机以自己的地址加入 Mac 的某个物理网络，因此该网络上的其他设备可以访问它，无需端口转发。

source: The guest’s network card lives inside vphone-vm, which opens ordinary connections on the Mac for it, so traffic follows the Mac’s VPN or proxy. Only forwarded ports reach the guest.
ja: ゲストのネットワークカードは vphone-vm の中にあり、vphone-vm がゲストの代わりに Mac 上で通常の接続を開くため、通信は Mac の VPN やプロキシに従います。ゲストに届くのは転送したポートだけです。
ko: 게스트의 네트워크 카드는 vphone-vm 안에 있으며, vphone-vm이 게스트 대신 Mac에서 일반 연결을 열기 때문에 트래픽은 Mac의 VPN이나 프록시를 따릅니다. 포워드한 포트만 게스트에 도달합니다.
vi: Card mạng của máy khách nằm trong vphone-vm, vốn mở các kết nối thông thường trên máy Mac thay cho nó, nên lưu lượng đi theo VPN hoặc proxy của Mac. Chỉ các cổng được chuyển tiếp mới đến được máy khách.
zh_hans: 客户机的网卡位于 vphone-vm 内部，由 vphone-vm 在 Mac 上代为建立普通连接，因此流量会遵循 Mac 的 VPN 或代理。只有转发的端口能访问客户机。

source: The helper and the network are checked last.
ja: ヘルパーとネットワークは最後に確認されます。
ko: 도우미와 네트워크는 마지막에 확인합니다.
vi: Trình trợ giúp và mạng được kiểm tra sau cùng.
zh_hans: 辅助工具和网络会最后检查。

source: Boot chain: ^[%lld patch](inflect: true) (TXM, device tree, LLB) not applied; only a restore applies them, which erases the data. Run `vphone-cli fw patches %@` for each.
ja: 起動チェーン：未反映 %lld 件（TXM・デバイスツリー・LLB）。復元でのみ反映され、復元するとデータは消去されます。各手順は `vphone-cli fw patches %@` で確認してください。
ko: 부트 체인: 미반영 %lld개(TXM, 디바이스 트리, LLB). 복원으로만 반영되며 복원하면 데이터가 지워집니다. 각 단계는 `vphone-cli fw patches %@`로 확인하세요.
vi: Chuỗi khởi động: %lld bản vá (TXM, cây thiết bị, LLB) chưa áp dụng; chỉ khôi phục mới áp dụng, việc này xoá dữ liệu. Chạy `vphone-cli fw patches %@` để xem từng bước.
zh_hans: 启动链：%lld 个补丁（TXM、设备树、LLB）未应用；只有重新恢复才会生效，而恢复会清除数据。运行 `vphone-cli fw patches %@` 查看各自步骤。

source: Update Kernel
ja: カーネルを更新
ko: 커널 업데이트
vi: Cập nhật kernel
zh_hans: 更新内核

source: Update Kernel swaps it into Preboot, keeping the data
ja: 「カーネルを更新」で Preboot に入れ替え、データは保持
ko: ‘커널 업데이트’로 Preboot에 교체하며 데이터 유지
vi: Cập nhật kernel sẽ thay nó vào Preboot, giữ nguyên dữ liệu
zh_hans: “更新内核”会将其换入 Preboot，保留数据

source: Updating kernel…
ja: カーネルを更新中…
ko: 커널 업데이트 중…
vi: Đang cập nhật kernel…
zh_hans: 正在更新内核…

source: Unable to update the kernel.
ja: カーネルを更新できません。
ko: 커널을 업데이트할 수 없습니다.
vi: Không thể cập nhật kernel.
zh_hans: 无法更新内核。

source: Swaps the Preboot kernelcache for the one this machine's patches resolve to, keeping the data (no restore).
ja: Preboot のカーネルキャッシュをこのマシンのパッチ選択に合うものに入れ替えます。データは保持され、復元は不要です。
ko: Preboot 커널 캐시를 이 머신의 패치 선택에 맞는 것으로 교체합니다. 데이터는 유지되며 복원이 필요 없습니다.
vi: Thay kernelcache trong Preboot bằng bản khớp với lựa chọn bản vá của máy này, giữ nguyên dữ liệu (không khôi phục).
zh_hans: 把 Preboot 的内核缓存换成与此虚拟机补丁选择匹配的版本，保留数据（无需恢复）。

source: System
ja: システム
ko: 시스템
vi: Hệ thống
zh_hans: 系统

source: TXM, DeviceTree and LLB change only in a restore. iBSS and iBEC matter only to the next one.
ja: TXM、DeviceTree、LLB は復元時にのみ変更されます。iBSS と iBEC は次回の復元にのみ影響します。
ko: TXM, DeviceTree, LLB는 복원할 때만 변경됩니다. iBSS와 iBEC는 다음 복원에만 영향을 줍니다.
vi: TXM, DeviceTree và LLB chỉ thay đổi khi khôi phục. iBSS và iBEC chỉ ảnh hưởng đến lần khôi phục tiếp theo.
zh_hans: TXM、DeviceTree 和 LLB 只在恢复时更改。iBSS 和 iBEC 只影响下一次恢复。

source: Takes effect at the next boot
ja: 次回の起動時に有効
ko: 다음 부팅 시 적용
vi: Có hiệu lực ở lần khởi động tiếp theo
zh_hans: 下次启动时生效

source: Stop the machine to update its kernel.
ja: カーネルを更新するにはマシンを停止してください。
ko: 커널을 업데이트하려면 머신을 중지하십시오.
vi: Hãy dừng máy để cập nhật kernel.
zh_hans: 停止虚拟机后才能更新其内核。

source: ^[%lld kernel patch](inflect: true) to apply with Update Kernel (keeps the data).
ja: 「カーネルを更新」で反映するカーネルのパッチ：%lld 件（データは保持）。
ko: ‘커널 업데이트’로 반영할 커널 패치 %lld개(데이터 유지).
vi: %lld bản vá kernel sẽ áp dụng bằng Cập nhật kernel (giữ dữ liệu).
zh_hans: %lld 个内核补丁可用“更新内核”生效（保留数据）。

# ^[%lld machine](inflect: true)
source: %lld machines
ja: %lld 台のマシン
ko: 머신 %lld대
vi: %lld máy ảo
zh_hans: %lld 台虚拟机

source: Apply to Guest
ja: ゲストに適用
ko: 게스트에 적용
vi: Áp dụng cho máy khách
zh_hans: 应用到客户机

source: Apply to Guest turns it on or off in place
ja: 「ゲストに適用」でその場でオン／オフ
ko: ‘게스트에 적용’으로 그 자리에서 켜거나 끔
vi: Áp dụng cho máy khách sẽ bật hoặc tắt tại chỗ
zh_hans: “应用到客户机”会就地打开或关闭

source: Updates the guest environment, which turns guest patches on or off to match this machine’s choice.
ja: ゲスト環境を更新し、このマシンの選択に合わせてゲストのパッチをオン／オフします。
ko: 게스트 환경을 업데이트하여 이 머신의 선택에 맞게 게스트 패치를 켜거나 끕니다.
vi: Cập nhật môi trường máy khách, bật hoặc tắt các bản vá máy khách cho khớp với lựa chọn của máy này.
zh_hans: 更新客户机环境，按此虚拟机的选择打开或关闭客户机补丁。

source: Stop the machine to apply its patch choice to the guest.
ja: パッチの選択をゲストに適用するには、マシンを停止してください。
ko: 패치 선택을 게스트에 적용하려면 머신을 중지하십시오.
vi: Hãy dừng máy để áp dụng lựa chọn bản vá cho máy khách.
zh_hans: 停止虚拟机后才能把补丁选择应用到客户机。

source: Stop the machine to apply.
ja: 適用するにはマシンを停止してください。
ko: 적용하려면 머신을 중지하십시오.
vi: Hãy dừng máy ảo để áp dụng.
zh_hans: 停止虚拟机后才能应用。

source: ^[%lld guest patch](inflect: true) to apply with Apply to Guest.
ja: 「ゲストに適用」で反映するゲストのパッチ：%lld 件。
ko: ‘게스트에 적용’으로 반영할 게스트 패치 %lld개.
vi: %lld bản vá máy khách sẽ được áp dụng bằng “Áp dụng cho máy khách”.
zh_hans: %lld 个客户机补丁可用“应用到客户机”生效。

source: ^[%lld boot chain patch](inflect: true) that only a restore applies.
ja: 復元でのみ反映される起動チェーンのパッチ：%lld 件。
ko: 복원으로만 반영되는 부트 체인 패치 %lld개.
vi: %lld bản vá chuỗi khởi động chỉ được áp dụng khi khôi phục.
zh_hans: %lld 个启动链补丁只有重新恢复才会生效。

# ^[%lld boot-essential patch](inflect: true) off
source: %lld boot-essential patches off
ja: 起動に必須のパッチ %lld 件がオフ
ko: 부팅 필수 패치 %lld개 꺼짐
vi: Đã tắt %lld bản vá thiết yếu cho khởi động
zh_hans: 已关闭 %lld 个启动必需补丁

source: vphone-cli fw patches %@ lists each one.
ja: 各パッチは vphone-cli fw patches %@ で確認できます。
ko: 각 패치는 vphone-cli fw patches %@ 로 확인할 수 있습니다.
vi: vphone-cli fw patches %@ liệt kê từng bản vá.
zh_hans: 运行 vphone-cli fw patches %@ 可逐个查看。

source: vphone-launchpad-cli talks to the running app over this socket, as the same user.
ja: vphone-launchpad-cli は同じユーザとして、このソケット経由で実行中の App と通信します。
ko: vphone-launchpad-cli는 같은 사용자로서 이 소켓을 통해 실행 중인 앱과 통신합니다.
vi: vphone-launchpad-cli giao tiếp với ứng dụng đang chạy qua socket này, dưới cùng người dùng.
zh_hans: vphone-launchpad-cli 以同一用户身份通过此套接字与正在运行的应用通信。

source: vphone-vm has no host-only network, so a machine set to it does not start. Choose NAT, Tunnel, Bridged or None in its settings.
ja: vphone-vm にはホストのみのネットワークがないため、このモードに設定したマシンは起動しません。マシンの設定で NAT、トンネル、ブリッジ、なしのいずれかを選択してください。
ko: vphone-vm에는 호스트 전용 네트워크가 없으므로 이 모드로 설정한 머신은 시작되지 않습니다. 머신 설정에서 NAT, 터널, 브리지 또는 없음을 선택하십시오.
vi: vphone-vm không có mạng chỉ máy chủ, nên máy ảo đặt chế độ này sẽ không khởi động. Hãy chọn NAT, Đường hầm, Cầu nối hoặc Không có trong cài đặt của nó.
zh_hans: vphone-vm 没有仅主机网络，因此设为此模式的虚拟机无法启动。请在其设置中选择 NAT、隧道、桥接或无。

source: No change
ja: 変更なし
ko: 변경 없음
vi: Không thay đổi
zh_hans: 无更改

source: No disk image
ja: ディスクイメージなし
ko: 디스크 이미지 없음
vi: Không có ảnh đĩa
zh_hans: 无磁盘映像

source: No host checks are skipped.
ja: スキップしたホストのチェックはありません。
ko: 건너뛴 호스트 검사가 없습니다.
vi: Không bỏ qua mục kiểm tra máy chủ nào.
zh_hans: 没有跳过的主机检查。

source: No images of this kind.
ja: この種類のイメージはありません。
ko: 이 종류의 이미지가 없습니다.
vi: Không có ảnh thuộc loại này.
zh_hans: 没有此种类的映像。

source: Saving patches…
ja: パッチを保存中…
ko: 패치 저장 중…
vi: Đang lưu bản vá…
zh_hans: 正在保存补丁…

source: Unavailable
ja: 利用できません
ko: 사용할 수 없음
vi: Không khả dụng
zh_hans: 不可用

source: Guest Environment
ja: ゲスト環境
ko: 게스트 환경
vi: Môi trường máy khách
zh_hans: 客户机环境

source: Host Programs
ja: ホストプログラム
ko: 호스트 프로그램
vi: Chương trình máy chủ
zh_hans: 主机程序

source: Host programs change at the next start. The guest environment is updated now on stopped machines; running machines keep theirs until it is updated later. Guest patches follow each machine’s patch choice when its guest environment is updated. The boot chain stays as it was built.
ja: ホストプログラムは次回の起動時に切り替わります。停止中のマシンではゲスト環境を今すぐ更新します。実行中のマシンは、後で更新するまで現在のゲスト環境のままです。ゲストのパッチは、ゲスト環境の更新時に各マシンのパッチ選択に従います。ブートチェーンは構築時のままです。
ko: 호스트 프로그램은 다음 시작부터 바뀝니다. 정지된 머신은 게스트 환경을 지금 업데이트하고, 실행 중인 머신은 나중에 업데이트할 때까지 기존 환경을 유지합니다. 게스트 패치는 게스트 환경을 업데이트할 때 각 머신의 패치 선택을 따릅니다. 부트 체인은 빌드된 그대로 유지됩니다.
vi: Chương trình máy chủ sẽ thay đổi từ lần khởi động tiếp theo. Môi trường máy khách được cập nhật ngay trên các máy đang dừng; máy đang chạy giữ môi trường hiện tại cho đến khi được cập nhật sau. Các bản vá máy khách theo lựa chọn bản vá của từng máy khi môi trường máy khách được cập nhật. Chuỗi khởi động giữ nguyên như khi được dựng.
zh_hans: 主机程序在下次启动时切换。已停止的机器会立即更新客户机环境；正在运行的机器保留原有环境，直到之后再更新。客户机补丁在更新客户机环境时按各机器的补丁选择应用。启动链保持构建时的状态。

source: IPSW cache
ja: IPSW キャッシュ
ko: IPSW 캐시
vi: Bộ nhớ đệm IPSW
zh_hans: IPSW 缓存

source: Install it in Core Bundle, or choose another version for this machine.
ja: 「コアバンドル」でインストールするか、このマシンに別のバージョンを選択してください。
ko: 코어 번들에서 설치하거나 이 머신에 다른 버전을 선택하세요.
vi: Hãy cài đặt trong Bundle lõi, hoặc chọn phiên bản khác cho máy này.
zh_hans: 请在“核心 Bundle”中安装，或为这台机器选择其他版本。

source: Local build %@ · Installed %@ · SHA-256 %@
ja: ローカルビルド %1$@ · インストール日 %2$@ · SHA-256 %3$@
ko: 로컬 빌드 %1$@ · 설치 %2$@ · SHA-256 %3$@
vi: Bản dựng cục bộ %1$@ · Cài đặt %2$@ · SHA-256 %3$@
zh_hans: 本地构建 %1$@ · 安装于 %2$@ · SHA-256 %3$@

source: No Core Bundle is installed. Install one in Core Bundle.
ja: コアバンドルがインストールされていません。「コアバンドル」でインストールしてください。
ko: 설치된 코어 번들이 없습니다. 코어 번들에서 설치하세요.
vi: Chưa cài Bundle lõi nào. Hãy cài đặt trong Bundle lõi.
zh_hans: 未安装核心 Bundle。请在“核心 Bundle”中安装。

source: No Core Bundle version is installed. Install one in Core Bundle.
ja: コアバンドルのバージョンがインストールされていません。「コアバンドル」でインストールしてください。
ko: 설치된 코어 번들 버전이 없습니다. 코어 번들에서 설치하세요.
vi: Chưa cài phiên bản Bundle lõi nào. Hãy cài đặt trong Bundle lõi.
zh_hans: 未安装任何核心 Bundle 版本。请在“核心 Bundle”中安装。

source: Not used by any machine
ja: どのマシンにも使われていません
ko: 어떤 머신에서도 사용하지 않음
vi: Không máy nào dùng
zh_hans: 没有机器使用
